load-test/results/browse-head-full.log


  Γûê TOTAL RESULTS 

    checks_total.......: 56280   267.417636/s
    checks_succeeded...: 100.00% 56280 out of 56280
    checks_failed......: 0.00%   0 out of 56280

    Γ£ô home 200
    Γ£ô projects 200
    Γ£ô page 200
    Γ£ô summary 200
    Γ£ô tasks p1 200
    Γ£ô tasks p50 200
    Γ£ô kanban 200

    HTTP
    http_req_duration..............: avg=389.11ms min=3.02ms   med=270.99ms max=2.36s p(90)=793.45ms p(95)=1.22s
      { expected_response:true }...: avg=389.11ms min=3.02ms   med=270.99ms max=2.36s p(90)=793.45ms p(95)=1.22s
    http_req_failed................: 0.00%  0 out of 56280
    http_reqs......................: 56280  267.417636/s

    EXECUTION
    iteration_duration.............: avg=3.22s    min=557.23ms med=2.54s    max=6.99s p(90)=5.98s    p(95)=6.28s
    iterations.....................: 8040   38.202519/s
    vus............................: 5      min=2          max=250
    vus_max........................: 250    min=250        max=250

    NETWORK
    data_received..................: 1.0 GB 5.0 MB/s
    data_sent......................: 64 MB  305 kB/s