load-test/results/browse-head-nocache.log


  Γûê TOTAL RESULTS 

    checks_total.......: 28259   134.387353/s
    checks_succeeded...: 100.00% 28259 out of 28259
    checks_failed......: 0.00%   0 out of 28259

    Γ£ô home 200
    Γ£ô projects 200
    Γ£ô page 200
    Γ£ô summary 200
    Γ£ô tasks p1 200
    Γ£ô tasks p50 200
    Γ£ô kanban 200

    HTTP
    http_req_duration..............: avg=858.62ms min=9.02ms  med=634.7ms max=4.09s  p(90)=1.74s  p(95)=2.54s 
      { expected_response:true }...: avg=858.62ms min=9.02ms  med=634.7ms max=4.09s  p(90)=1.74s  p(95)=2.54s 
    http_req_failed................: 0.00%  0 out of 28259
    http_reqs......................: 28259  134.387353/s

    EXECUTION
    iteration_duration.............: avg=6.51s    min=643.1ms med=5.63s   max=13.61s p(90)=12.03s p(95)=12.39s
    iterations.....................: 4037   19.198193/s
    vus............................: 5      min=2          max=250
    vus_max........................: 250    min=250        max=250

    NETWORK
    data_received..................: 523 MB 2.5 MB/s
    data_sent......................: 32 MB  153 kB/s